src/test/resources/org/lockss/ws/content/reactivateAusByIdListRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/ContentConfigurationService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://content.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:reactivateAusByIdList>
            <auIds>org|lockss|plugin|pensoft|oai|PensoftOaiPlugin&amp;au_oai_date~2013&amp;au_oai_set~bdj&amp;base_url~http%3A%2F%2Fbdj%2Epensoft%2Enet%2F</auIds>
            <auIds>org|lockss|plugin|pensoft|oai|PensoftOaiPlugin&amp;au_oai_date~2016&amp;au_oai_set~africaninvertebrates&amp;base_url~https%3A%2F%2Fafricaninvertebrates%2Epensoft%2Enet%2F</auIds>
        </service:reactivateAusByIdList>
    </soapenv:Body>
</soapenv:Envelope>
